#    მეექვსე ხაზზე დავადეკლარირეთ ცვლადი სახელად num1. input ფუნქციის გამოყენებით,
# ბრჭყალებში არსებული ტექსტი (სტრინგი) "Please enter the 1st number: " გამოვიტანეთ
# სქრინზე და ცვლადის მნიშვნელობა დამოკიდებული გავხადეთ მომხმარებელზე, ხოლო 
# int ფუნქციის გამოყენებით ჩვენი შექმნილი string ტიპის ცვლადი სახელად num1 გავხადეთ
# int ტიპის. საბოლოოდ ინტეჯერი შენახულია ცვლადში.
num1 = int(input("Please enter the 1st nubmer: "))

#    მეცამეტე ხაზზე დავადეკლარირეთ ცვლადი სახელად num2. input ფუნქციის გამოყენებით, 
# ბრჭყალებში არსებული ტექსტი (სტრინგი) "Please enter the 2nd number: " გამოვიტანეთ
# სქრინზე და ცვლადის მნიშვნელობა დამოკიდებული გავხადეთ მომხმარებელზე, ხოლო 
# int ფუნქციის გამოყენებით ჩვენი შექმნილი string ტიპის ცვლადი სახელად num2 გავხადეთ
# int ტიპის. საბოლოოდ ინტეჯერი შენახულია ცვლადში.
num2 = int(input("Please enter the 2nd number: "))

#    მეოცე ხაზზე დავადეკლარირეთ ცვლადი სახელად num3. input ფუნქციის გამოყენებით,
# ბრჭყალებში არსებული ტექსტი (სტრინგი) "Please enter the 3rd number: " გამოვიტანეთ 
# სქრინზე და ცვლადის მნიშვნელობა დამოკიდებული გავხადეთ მომხმარებელზე, ხოლო 
# int ფუნქციის გამოყენებით ჩვენი შექმნილი string ტიპის ცვლადი სახელად num3 გავხადეთ
# int ტიპის. საბოლოოდ ინტეჯერი შენახულია ცვლადში.
num3 = int(input("Please enter the 3rd number: "))

#    ოცდამეოთხე ხაზზე დავადეკლარირეთ ცვლადი სახელად result და მივანიჭეთ მნიშვნელობა 
# სამი int ტიპის ცვლადის ნამრავლი.
result = (num1 * num2 * num3)

#    ოცდამერვე ხაზზე გამოვიძახეთ ცვლადი result და print ფუნქციის საშუალებით 
# გამოვიტანეთ მისი მნიშვნელობა.
print(result)