#მეორე ხაზზე დავადეკლარირეთ სტრინგ ცვლადი სახელად name. input ფუნქციის გამოყენებით, ბრჭყალებში არსებული ტექსტი (სტრინგი) "Please enter your name: "" გამოვიტანეთ სქრინზე და ცვლადის მნიშვნელობა დამოკიდებული გავხადეთ მომხმარებელზე. 
name = input("Please enter your name: ")

#მეხუთე ხაზზე დავადეკლარირეთ სტრინგ ცვლადი სახელად surname. input ფუნქციის გამოყენებით, ბრჭყალებში არსებული ტექსტი (სტრინგი) "Please enter your surname: " გამოვიტანეთ სქრინზე და ცვლადის მნიშვნელობა დამოკიდებული გავხადეთ მომხმარებელზე. 
surname = input("Please enter your surname: ")

#მერვე ხაზზე დავადეკლარირეთ სტრინგ ცვლადი სახელად age. input ფუნქციის გამოყენებით, ბრჭყალებში არსებული ტექსტი (სტრინგი) "Please enter your age: " გამოვიტანეთ სქრინზე და ცვლადის მნიშვნელობა დამოკიდებული გავხადეთ მომხმარებელზე. 
age = input("Please enter your age: ")

#მეთერთმეტე ხაზზე დავადეკლარირეთ სტრინგ ცვლადი სახელად introduction და მივანიჭეთ მნიშვნელობა - "Hello. I am " + name + " " + surname + ". I am " + age + " years old".
introduction = ("Hello. I am " + name + " " + surname + ". I am " + age + " years old")

#მეთოთხმეტე ხაზზე გამოვიძახეთ ცვლადი introduction და print ფუნქციის საშუალებით გამოვიტანეთ მისი მნიშვნელობა.
print(introduction)

